Repository: shinee0130/contactsafe
Catalog: lib/l10n/app_*.arb
Languages: mn

source: Contacts
mn: Харилцагчид

source: Search
mn: Хайх

source: Events
mn: Үйл явдал

source: Photos
mn: Зураг

source: Settings
mn: Тохиргоо

source: Group
mn: Бүлэг

source: No photos
mn: Зураг алга

source: Delete All
mn: Бүгдийг устгах

source: Language
mn: Хэл

# noResults
source: No results found
mn: Үр дүн олдсонгүй

source: Add Event
mn: Үйл явдал нэмэх

source: New Event
mn: Шинэ үйл явдал

source: Select Date
mn: Огноо сонгох

source: Participants
mn: Оролцогчид

source: None
mn: Байхгүй

source: Location
mn: Байршил

source: Description
mn: Тайлбар

source: Cancel
mn: Цуцлах

source: Create
mn: Үүсгэх

source: Title
mn: Гарчиг

source: Select Participants
mn: Оролцогч сонгох

source: Add Participants
mn: Оролцогч нэмэх

source: Choose Location on Map
mn: Газрын зураг дээр сонгох

# eventAdded
source: Event added successfully!
mn: Үйл явдал амжилттай нэмэгдлээ!

source: Failed to add event
mn: Үйл явдал нэмэхэд алдаа гарлаа

source: Save
mn: Хадгалах

source: Create contact
mn: Харилцагч үүсгэх

source: First name
mn: Нэр

source: Last name
mn: Овог

source: Company
mn: Байгууллага

source: Mobile
mn: Гар утас

source: Home
mn: Гэр

source: Work
mn: Ажил

source: Pager
mn: Пэйжер

source: Other
mn: Бусад

source: Custom
mn: Өөрөө

source: Phone
mn: Утас

source: Enter phone number
mn: Утасны дугаар оруулна уу

source: Add phone
mn: Утас нэмэх

source: Email
mn: Имэйл

source: Add email
mn: Имэйл нэмэх

source: Address
mn: Хаяг

source: Add address
mn: Хаяг нэмэх

source: Enter address
mn: Хаягаа оруулна уу

# exampleEmail
source: example@email.com
mn: jishoo@email.com

source: Birthday
mn: Төрсөн өдөр

source: Add birthday
mn: Төрсөн өдөр нэмэх

source: Change picture
mn: Зураг солих

source: Add picture
mn: Зураг нэмэх

# contactSavedDevice
source: Contact saved to device!
mn: Харилцагч төхөөрөмжид хадгалагдлаа!

# contactPermissionDenied
source: Contact permission denied. Cannot save to device.
mn: Харилцагч хадгалах зөвшөөрөл байхгүй.

# contactSavedCloud
source: Contact saved to Cloud Firestore!
mn: Харилцагч үүлэнд хадгалагдлаа!

# failedToSaveContact
source: Failed to save contact: {error}
mn: Харилцагч хадгалах үед алдаа гарлаа: {error}

# photoPermissionDenied
source: Photo library permission denied.
mn: Зураг авах зөвшөөрөл байхгүй.

# photoPermissionPermanentlyDenied
source: Photo library permission permanently denied. Please enable in settings.
mn: Зургийн зөвшөөрөл бүрэн хаагдсан. Тохиргооноос идэвхжүүлнэ үү.

source: Remove
mn: Устгах

source: Family
mn: Гэр бүл

source: Friends
mn: Найзууд

source: Emergency
mn: Онцгой

source: Not assigned
mn: Хуваарилаагүй

# assignToGroup
source: Assign to "{groupName}"
mn: "{groupName}" бүлэгт хуваарилах

# noContactsFound
source: No contacts found on your device.
mn: Таны төхөөрөмжид харилцагч олдсонгүй.

# contactsAssignedToGroup
source: Contacts assigned to "{groupName}"
mn: "{groupName}" бүлэгт харилцагчид нэмэгдлээ.

source: Contact Information
mn: Харилцагчийн мэдээлэл

source: Call
mn: Залгах

source: Message
mn: Зурвас

source: Files
mn: Файл

source: Notes
mn: Тэмдэглэл

source: Export VCF
mn: VCF рүү экспортлох

# noPhoneNumber
source: No phone number available
mn: Утасны дугаар байхгүй

# noEmailAddress
source: No email address available
mn: Имэйл хаяг байхгүй

# calling
source: Calling {name}
mn: {name}-руу залгаж байна

# messaging
source: Messaging {name}
mn: {name}-д зурвас илгээж байна

# emailing
source: Emailing {name}
mn: {name}-д имэйл илгээж байна

# favoriteStatusToggled
source: {name} favorite status toggled!
mn: {name} дуртайд нэмэгдлээ!

# contactExported
source: Contact exported to: {filePath}
mn: Харилцагч экспортлогдсон: {filePath}

source: Error accessing storage.
mn: Санах ойд хандахад алдаа гарлаа.

# errorSavingVcf
source: Error saving VCF file: {error}
mn: VCF хадгалах үед алдаа гарлаа: {error}

# storagePermissionDenied
source: Storage permission denied. Please enable in settings.
mn: Санах ойн зөвшөөрөл байхгүй. Тохиргоогоор идэвхжүүлнэ үү.

# couldNotLaunchPhone
source: Could not launch phone call
mn: Утасны дуудлага хийх боломжгүй

# couldNotLaunchSms
source: Could not launch messaging app
mn: Зурвас илгээх боломжгүй

# couldNotLaunchEmail
source: Could not launch email app
mn: Имэйл илгээх боломжгүй

source: No files available
mn: Файл байхгүй

# tapToAddFiles
source: Tap the + button to add files
mn: Файл нэмэхийн тулд + товч дарна уу

source: Delete
mn: Устгах

source: Edit
mn: Засах

source: Add
mn: Нэмэх

source: Sort Files By
mn: Файлыг эрэмбэлэх

source: Name (A-Z)
mn: Нэр (А-Я)

source: Name (Z-A)
mn: Нэр (Я-А)

# dateOldest
source: Date (Oldest first)
mn: Огноо (Хуучнаас шинэ рүү)

# dateNewest
source: Date (Newest first)
mn: Огноо (Шинэээс хуучин руу)

# sizeSmallest
source: Size (Smallest first)
mn: Хэмжээ (Багаас их рүү)

# sizeLargest
source: Size (Largest first)
mn: Хэмжээ (Ихээс бага руу)

source: Rename File
mn: Файлын нэр солих

source: Enter new name
mn: Шинэ нэр оруулна уу

source: Share
mn: Хуваалцах

source: File deleted
mn: Файл устгагдлаа

# fileDeleteFailed
source: Failed to delete file: {error}
mn: Файл устгахад алдаа гарлаа: {error}

# failedToLoadFiles
source: Failed to load files: {error}
mn: Файл ачаалахад алдаа гарлаа: {error}

# fileUploadSuccess
source: {count} file(s) uploaded successfully.
mn: {count} файл амжилттай нэмэгдлээ.

# fileUploadFail
source: {count} file(s) failed to upload.
mn: {count} файл нэмэхэд алдаа гарлаа.

# fileUploadNone
source: No files selected or processed.
mn: Файл сонгогдоогүй байна.

# selectedFilesDeleted
source: Selected files deleted successfully!
mn: Сонгосон файл устгагдлаа!

# failedToDeleteSelected
source: Failed to delete selected files: {error}
mn: Файл устгахад алдаа гарлаа: {error}

# failedToRenameFile
source: Failed to rename file: {error}
mn: Файлын нэр өөрчлөхөд алдаа гарлаа: {error}

# failedToShareFile
source: Failed to share file: {error}
mn: Файл хуваалцахад алдаа гарлаа: {error}

# unableToRetrieveFile
source: Unable to retrieve file data
mn: Файл авах боломжгүй

# failedToOpenFile
source: Failed to open file: {error}
mn: Файл нээхэд алдаа гарлаа: {error}

# couldNotDownloadFile
source: Could not download file data
mn: Файл татаж авч чадсангүй

source: Could not open file
mn: Файл нээж чадсангүй

source: Groups
mn: Бүлгүүд

source: Done
mn: Дууссан

source: Select all groups
mn: Бүх бүлгийг сонгох

source: New Group
mn: Шинэ бүлэг

# enterNewGroup
source: Enter the name for your new group:
mn: Шинэ бүлгийн нэрээ оруулна уу:

source: Group name
mn: Бүлгийн нэр

source: Ok & add contacts
mn: OK & харилцагч нэмэх

# groupExists
source: Group "{groupName}" already exists.
mn: "{groupName}" бүлэг аль хэдийнээ бий.

# notesScreenTitle
source: {contactName} - Notes
mn: {contactName} - Тэмдэглэл

# noNotesTitle
source: No notes yet
mn: Тэмдэглэл алга

# noNotesSubtitle
source: Tap the + button to add your first note
mn: + товч дарж тэмдэглэл нэмнэ үү

source: Add New Note
mn: Шинэ тэмдэглэл нэмэх

source: Edit Note
mn: Тэмдэглэл засах

# writeNoteHint
source: Write your note here...
mn: Тэмдэглэлээ энд бичнэ үү...

# noteEdited
source: Edited
mn: Зассан

# failedToLoadNotes
source: Failed to load notes: {error}
mn: Тэмдэглэл ачаалахад алдаа: {error}

# failedToAddNote
source: Failed to add note: {error}
mn: Тэмдэглэл нэмэхэд алдаа: {error}

# failedToUpdateNote
source: Failed to update note: {error}
mn: Тэмдэглэл засахад алдаа: {error}

# failedToDeleteNote
source: Failed to delete note: {error}
mn: Тэмдэглэл устгахад алдаа: {error}

source: Edit contact
mn: Харилцагч засах

source: Delete Contact
mn: Харилцагч устгах

# contactUpdated
source: Contact updated successfully!
mn: Харилцагч амжилттай шинэчлэгдлээ!

# contactUpdateFailed
source: Failed to update contact: {error}
mn: Харилцагч шинэчлэхэд алдаа: {error}

# contactDeleted
source: Contact deleted successfully!
mn: Харилцагч устгагдлаа!

# contactDeleteFailed
source: Failed to delete contact: {error}
mn: Харилцагч устгахад алдаа: {error}

# noteDetailTitle
source: Note
mn: Тэмдэглэл

source: Delete note
mn: Тэмдэглэл устгах

source: Add Contact
mn: Харилцагч нэмэх

source: Close
mn: Хаах

# emailAction
source: Email
mn: Имэйл

source: Favorite
mn: Дуртай

source: Unfavorite
mn: Дуртайгаас хасах

source: Export VCF
mn: VCF рүү экспортлох

source: File uploaded
mn: Файл нэмэгдсэн

source: File renamed
mn: Файлын нэр өөрчлөгдсөн

# noFiles
source: No files available
mn: Файл алга

# noNotes
source: No notes yet
mn: Тэмдэглэл алга

# tapToAddNote
source: Tap the + button to add your first note
mn: + товч дарж шинэ тэмдэглэл нэмнэ үү

source: Note
mn: Тэмдэглэл

source: Add Note
mn: Тэмдэглэл нэмэх

# enterGroupName
source: Enter the name for your new group
mn: Шинэ бүлгийн нэрээ оруулна уу

# searchHint
source: Search
mn: Хайх

source: Event Details
mn: Үйл явдлын дэлгэрэнгүй

source: Event Title
mn: Үйл явдлын гарчиг

# eventDate
source: Date
mn: Огноо

# eventLocation
source: Location
mn: Байршил

# eventDescription
source: Description
mn: Тайлбар

source: Edit Event
mn: Үйл явдал засах

source: Delete Event
mn: Үйл явдал устгах

# noParticipants
source: No participants added.
mn: Оролцогч нэмэгдээгүй.

# mapUnavailable
source: Map location unavailable. Could not geocode address.
mn: Газрын байршил олдсонгүй.

# permissionDenied
source: Permission denied. Please enable in settings.
mn: Зөвшөөрөл олгогдоогүй байна. Тохиргооноос идэвхжүүлнэ үү.

source: Sort Events By
mn: Үйл явдлыг эрэмбэлэх

source: Title (A-Z)
mn: Гарчиг (А-Я)

source: Title (Z-A)
mn: Гарчиг (Я-А)

source: Description (Optional)
mn: Тайлбар (заавал биш)

source: Date
mn: Огноо

# noContactsAvailable
source: No contacts available to add.
mn: Харилцагч нэмэх боломжгүй байна.

source: Select
mn: Сонгох

# locationPermissionRecommended
source: Location permission is recommended for map features.
mn: Газрын зүйн зөвшөөрөл шаардагдана.

source: Location permission denied.
mn: Байршлын зөвшөөрөл олгогдоогүй.

# locationPermissionPermanentlyDenied
source: Location permission permanently denied. Please enable it in app settings.
mn: Байршлын зөвшөөрөл бүрэн хаагдсан. Тохиргооноос идэвхжүүлнэ үү.

# contactsPermissionRequired
source: Contacts permission is required to add participants.
mn: Оролцогч нэмэхийн тулд харилцагчийн зөвшөөрөл хэрэгтэй.

source: Error fetching contacts
mn: Харилцагч ачаалах үед алдаа гарлаа

source: Error loading events
mn: Үйл явдал ачаалахад алдаа гарлаа

# locationColon
source: Location:
mn: Байршил:

# dateColon
source: Date:
mn: Огноо:

# participantsColon
source: Participants:
mn: Оролцогчид:

# descriptionColon
source: Description:
mn: Тайлбар:

# pleaseFillAllEventFields
source: Please enter a title, select a date, and select a location.
mn: Гарчиг, огноо, байршил сонгоно уу.

source: Choose Event Location
mn: Үйл явдлын байршил сонгох

# locationPermissionNeeded
source: Location permission is needed to show your current location.
mn: Байршлыг үзүүлэхэд зөвшөөрөл хэрэгтэй.

source: Could not get current location.
mn: Одоогийн байршлыг тогтооход алдаа.

source: Picked Location
mn: Сонгосон байршил

# tapToPickLocation
source: Tap on the map to pick a location
mn: Газрын зураг дээр дарж байршил сонгоно уу

source: Select This Location
mn: Энэ байршлыг сонгох

source: Failed to load photos
mn: Зураг ачаалахад алдаа гарлаа

source: From
mn: Хэнээс

# user_pin
source: PIN code
mn: PIN код

source: Use Password
mn: Нууц үг ашиглах

source: Use FaceID
mn: FaceID ашиглах

source: Tab Bar Order
mn: Tab Bar дараалал

source: Sort by First Name
mn: Нэрээр эрэмбэлэх

# lastNameFirst
source: Show Last Name First
mn: Овгоор эхлэх

# saved_useFaceId
source: Saved useFaceId: {value}
mn: FaceID ашиглах тохиргоо хадгалагдлаа: {value}

# no_saved_tabBar_order
source: No saved TabBar order found, using default.
mn: TabBar-ийн дараалал олдсонгүй, анхны тохиргоо байна.

# error_decoding_tabBar_order
source: Error decoding saved TabBar order: {error}
mn: TabBar дараалал уншихад алдаа: {error}

# saved_tabBar_order
source: Saved TabBar order: {labels}
mn: TabBar-ийн дараалал хадгалагдлаа: {labels}

# error_importing_contacts
source: Error importing contacts: {error}
mn: Харилцагч импортлоход алдаа: {error}

# failed_import_contacts
source: Failed to import contacts: {error}
mn: Харилцагч импортлоход алдаа: {error}

# error_creating_backup
source: Error creating backup: {error}
mn: Нөөцлөлт үүсгэхэд алдаа: {error}

# failed_create_backup
source: Failed to create backup: {error}
mn: Нөөц үүсгэхэд алдаа: {error}

source: Failed to download file
mn: Файл татаж авахад алдаа гарлаа

# error_restoring_backup
source: Error restoring backup: {error}
mn: Нөөц сэргээхэд алдаа: {error}

# failed_restore_backup
source: Failed to restore backup: {error}
mn: Нөөц сэргээхэд алдаа: {error}

source: Google sign in failed
mn: Google нэвтрэлт амжилтгүй

source: No backup file found
mn: Нөөц файл олдсонгүй

source: Invalid file id
mn: Файлын ID буруу байна

# error_importing_from_link
source: Error importing from link: {error}
mn: Линкээр импортлох үед алдаа: {error}

# failed_import_backup_from_link
source: Failed to import backup from link: {error}
mn: Линкээр нөөц импортлоход алдаа: {error}

# error_deleting_all_data
source: Error deleting all data: {error}
mn: Бүх өгөгдөл устгахад алдаа: {error}

# failed_delete_all_data
source: Failed to delete all data: {error}
mn: Бүх өгөгдөл устгахад алдаа: {error}

# please_authenticate_faceid
source: Please authenticate to enable FaceID/Fingerprint
mn: FaceID/Хурууны хээг идэвхжүүлэхийн тулд нэвтэрнэ үү

# pin_enter_title
source: Enter PIN
mn: PIN оруулах

# pin_set_title
source: Set PIN
mn: PIN үүсгэх

# pin_error
source: PIN code is incorrect
mn: PIN буруу байна

# pin_empty_error
source: Please enter PIN code
mn: PIN код оруулна уу

# pin_button_cancel
source: Cancel
mn: Цуцлах

# pin_dialog_title
source: Enter your PIN
mn: PIN кодоо оруулна уу

# pin_dialog_error
source: Incorrect PIN. Please try again.
mn: PIN буруу байна. Дахин оролдоно уу.

# select_tabbar_order_title
source: Select TabBar Order
mn: TabBar дараалал сонгох

source: Privacy
mn: Хувийн нууцлал

source: Open in "Settings" app
mn: "Тохиргоо" апп руу нээх

source: About
mn: Апп-ын тухай

source: Version
mn: Хувилбар

source: Imprint
mn: Импрессум

source: Privacy Policy
mn: Нууцлалын бодлого

source: General
mn: Ерөнхий

source: Sort by first name
mn: Нэрээр эрэмбэлэх

source: Last name first
mn: Овгоор эхлэх

source: Data Management
mn: Өгөгдлийн менежмент

source: Import contacts
mn: Харилцагч импортлох

source: Create backup
mn: Нөөц үүсгэх

source: Restore from backup
mn: Нөөцөөс сэргээх

source: Backup to Google Drive
mn: Google Drive руу нөөцлөх

source: Restore from Google Drive
mn: Google Drive-с сэргээх

source: Import backup from link
mn: Линкээр нөөц импортлох

# app_customization_and_reset
source: App Customization & Reset
mn: Апп тохиргоо болон дахин тохируулах

source: Onboard Tour
mn: Танилцуулга

source: Select TabBar order
mn: TabBar дараалал сонгох

source: Delete all app data
mn: Бүх өгөгдлийг устгах

source: Security
mn: Аюулгүй байдал

source: Use PIN
mn: PIN ашиглах

# use_biometrics
source: Use Biometrics (Face ID/Fingerprint)
mn: Биометрик (FaceID/Хурууны хээ)

source: Change PIN
mn: PIN өөрчлөх

source: Powered by InAppSettingKit
mn: InAppSettingKit ашигласан

source: Delete All Data?
mn: Бүх өгөгдлийг устгах уу?

# delete_all_data_confirm
source: Are you sure you want to delete ALL data from ContactSafe? This action cannot be undone.
mn: ContactSafe-ийн бүх өгөгдлийг устгахдаа итгэлтэй байна уу? Энэ үйлдлийг буцаах боломжгүй.

# successfully_imported_contacts
source: Successfully imported {count} contacts!
mn: {count} харилцагч амжилттай импортлогдлоо!

# backup_created_successfully
source: Backup created successfully at {fileName}
mn: Нөөц амжилттай үүслээ: {fileName}

# failed_to_create_backup
source: Failed to create backup: {error}
mn: Нөөц үүсгэхэд алдаа: {error}

# restored_contacts_from_backup
source: Restored {count} contacts from backup!
mn: {count} харилцагч нөөцөөс сэргээгдлээ!

# failed_to_restore_backup
source: Failed to restore backup: {error}
mn: Нөөцөөс сэргээхэд алдаа: {error}

source: Backup uploaded to Google Drive
mn: Google Drive руу амжилттай нөөцлөв

# backup_failed
source: Backup failed: {error}
mn: Нөөцлөхөд алдаа гарлаа: {error}

# restored_contacts_from_google_drive
source: Restored {count} contacts from Google Drive
mn: {count} харилцагч Google Drive-с сэргээгдлээ

# restore_failed
source: Restore failed: {error}
mn: Сэргээхэд алдаа: {error}

# imported_contacts_from_link
source: Imported {count} contacts from link
mn: {count} харилцагч линкээр импортлогдлоо

# import_failed
source: Import failed: {error}
mn: Импортлоход алдаа: {error}

source: Could not open {url}
mn: {url} нээж чадсангүй

# tabbar_order_updated
source: TabBar order updated successfully!
mn: TabBar дараалал амжилттай шинэчлэгдлээ!

# all_app_data_deleted
source: All application data has been deleted.
mn: Бүх өгөгдөл устгагдлаа.

# failed_to_delete_all_data
source: Failed to delete all data: {error}
mn: Бүх өгөгдөл устгахад алдаа: {error}

# pins_do_not_match
source: PINs do not match. Please try again.
mn: PIN таарахгүй байна. Дахин оролдоно уу.

source: PIN enabled.
mn: PIN идэвхжлээ.

source: PIN setup canceled or invalid.
mn: PIN тохиргоо цуцлагдсан эсвэл буруу байна.

source: PIN disabled.
mn: PIN идэвхгүй боллоо.

source: PIN changed successfully
mn: PIN амжилттай солигдлоо

source: PIN change canceled or invalid.
mn: PIN солих цуцлагдсан эсвэл буруу байна.

source: Biometrics enabled.
mn: Биометрик идэвхжлээ.

source: Authentication failed or canceled.
mn: Баталгаажуулалт амжилтгүй эсвэл цуцлагдсан.

source: No biometrics available.
mn: Биометрик боломжгүй.

source: Biometrics disabled.
mn: Биометрик идэвхгүй.

source: Enter backup link
mn: Нөөц линк оруулах

source: Import
mn: Импортлох

source: Confirm
mn: Батлах

source: Create a 4-digit PIN
mn: 4 оронтой PIN үүсгэнэ үү

source: Confirm your PIN
mn: PIN-ээ баталгаажуулна уу

source: Enter your PIN
mn: PIN оруулна уу

# incorrect_pin_try_again
source: Incorrect PIN. Please try again.
mn: PIN буруу байна. Дахин оролдоно уу.
